[
    {
      "quote": "If anyone travels on a road in search of knowledge, Allah will cause him to travel on one of the roads of Paradise.",
      "author": "Prophet Muhammad ﷺ"
    },
    {
      "quote": "The knowledge from which no benefit is derived is like a treasure out of which nothing is spent in the cause of Allah.",
      "author": "Prophet Muhammad ﷺ"
    },
    {
      "quote": "The seeking of knowledge is obligatory for every Muslim",
      "author": "Prophet Muhammad ﷺ"
    },
    {
      "quote": "Allah will not be merciful to those who are not merciful to people.",
      "author": "Prophet Muhammad ﷺ"
    },
    {
      "quote": "A strong person is not the person who throws his adversaries to the ground. A strong person is the one who contains himself when he is angry.",
      "author": "Prophet Muhammad ﷺ"
    },
    {
      "quote": "Wasting time is worse than death, because death separates you from this world whereas wasting time separates you from Allah.",
      "author": "Ibn Al-Qayyim(RahimahuLlah)"
    },
    {
        "quote": "It is better for any of you to carry a load of firewood on his own back than to beg from someone else .",
        "author": "Prophet Muhammad ﷺ"
      },
      {
        "quote": "Do not turn away a poor man…even if all you can give is half a date.",
        "author": "Prophet Muhammad ﷺ"
      },
      {
        "quote": "Do good deeds properly, sincerely and moderately and know that your deeds will not make you enter Paradise, and that the most beloved deed to Allah’s is the most regular and constant even though it were little",
        "author": "Prophet Muhammad ﷺ"
      },
      {
        "quote": "He will not enter Paradise whose neighbour is not secure from his wrongful conduct",
        "author": "Prophet Muhammad ﷺ"
      },
      {
        "quote": "There is reward for kindness to every living thing.",
        "author": "Prophet Muhammad ﷺ"
      },
      {
        "quote": "Be kind, for whenever kindness becomes part of something, it beautifies it. Whenever it is taken from something, it leaves it tarnished.",
        "author": "Prophet Muhammad ﷺ"
      },
      {
        "quote": "Do not belittle a small sin,for the biggest of fires can be caused by smallest of sparks.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "The crying of the sinners is more loved to Allah than the tasbeeh of the arrogant.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "When you do not have knowledge someone can bring you dirt and you will believe it is gold.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "Patience is when the heart doesn’t lament and the mouth doesn’t complain.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "There is nothing more beneficial to the heart than reciting the Quran.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "Sitting with the poor and less fortunate people removes the ego and pride from your heart.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "Sins destroy the heart the same way poison destroys the body.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "And when the eye no longer cries out of fear of Allah, know that this drought originates from the hardness of the heart.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote":"Deeds without sincerity are like a traveler who carries in his water jug dirt. The carrying of its burden him and it brings no benefit.",
        "author":"Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "Don’t carry anxiety for the future because it is in the hands of Allah.",
        "author":"Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "A calamity that makes you turn to Allah is better for you then a blessing which makes you forget the remembrance of Allah",
        "author": "Ibn Taymiyyah(RahimahuLlah)"
      },
      {
        "quote":"The disease that knowledge brings is arrogance, and the disease that worship brings is showing off",
        "author": "Ibn Taymiyyah(RahimahuLlah)"
      },
      {
        "quote":"Dhikr (remembrance of Allah) is to the heart as water is to a fish; see what happens to a fish when it is taken out of water",
        "author": "Ibn Taymiyyah(RahimahuLlah)"
      },
      {
        "quote":"Imprisoned is he whose heart is imprisoned from Allâh. Captured is he who is captured by his desires.",
        "author": "Ibn Taymiyyah(RahimahuLlah)"
      },
      {
        "quote":"Contentment is the greatest door that one enters to Allah, it is the source of tranquility for the worshiper and paradise on earth. Whoever does not enter it will not enter the Paradise in the Hereafter.",
        "author": "Ibn Taymiyyah(RahimahuLlah)"
      },
      {
        "quote":"Don't depend too much on anyone.",
        "author": "Ibn Taymiyyah(RahimahuLlah)"
      },
      {
        "quote":"My heart is at ease knowing that what was meant for me will never miss me, and that what misses me was never meant for me.",
        "author": "Imam Al-Shafi‘i(RahimahuLlah)"
      },
      {
        "quote":"To be able to thank Allah for a blessing is a blessing within itself.",
        "author":"Imam Al-Shafi‘i(RahimahuLlah)"
      },
      {
        "quote":"To admonish your brother in private is to advise him and improve him. But to admonish him publicly is to disgrace and shame him.",
        "author": "Imam Al-Shafi‘i(RahimahuLlah)"
      },
      {
        "quote":"Avoid jealously for this destroys good deeds as fire destroys wood.",
        "author": "Abu Hurairah(RadhiyaLlahu Anhu)"
      },
      {
        "quote":"Indecency in anything spoils it. And modesty in anything adorns it.",
        "author": "Ibn Majah(RahimahuLlah)"
      },
      {
        "quote":"If a heart becomes attached to anything other than Allah, Allah makes him dependent on what he is attached to. And he will be betrayed by it.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote":"Happiness is attained by three things: being patient when tested, being thankful when receiving a blessing, and being repentant upon sinning.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "If you wish to check how much you love Allah, then see how much your heart loves the Quran, and you will know the answer.",
        "author": "Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote": "Beware of every hour and how it passes, and only spend it in the best possible way, do not neglect yourself, but render it accustomed to the noblest and best of actions, and send to your grave that which will please you when you arrive to it.",
        "author":"Ibn Al-Qayyim(RahimahuLlah)"
      },
      {
        "quote":"Beware of preoccupying your heart with what it has not been created for.",
        "author":"Ibn Al-Qayyim(RahimahuLlah)"
      }
  ]
  